Tests/tulo.JsonConverterToXmlCiiTests/JsonExamples/ZF_Extended__Abschlagsrechnung_SubInvoiceLine_u_LV_Nr_.json

{
  "InvoiceNumber": "210111 mit LV",
  "InvoiceDate": "2026-05-30",
  "Currency": "EUR",
  "DocumentName": "ABSCHLAGSRECHNUNG",
  "DocumentTypeCode": "875",
  "Seller": {
    "ID": "998877",
    "Name": "Musterbetrieb AG Demodaten",
    "Street": "August-Spindler-Strasse 222",
    "Zip": "37079",
    "City": "Göttingen",
    "CountryCode": "DE",
    "VatId": "DE09687654321",
    "LeitwegId": "",
    "FiscalId": null,
    "GeneralEmail": null,
    "ContactPersonName": "Kontaktperson",
    "ContactPhone": "5578",
    "ContactEmail": "absender@musterberieb.de",
    "LegalOrganizationId": "HRA 45678"
  },
  "Buyer": {
    "ID": "330145",
    "Name": "Auftraggeber Firmenkunde GmbH",
    "Street": "Gartenstraße 1212",
    "Zip": "37073",
    "City": "Göttingen",
    "CountryCode": "DE",
    "VatId": "DE1234567890",
    "LeitwegId": "",
    "FiscalId": null,
    "GeneralEmail": null,
    "ContactPersonName": "Herr Thomas Auftraggeber",
    "ContactPhone": "+49 321 456789",
    "ContactEmail": "thomas.auftraggeber@Firmenkunde.de",
    "LegalOrganizationId": null
  },
  "Payment": {
    "Iban": "DE75512108001245126199",
    "Bic": "PBNKDEFF",
    "AccountName": "Musterbetrieb Kontoname",
    "PaymentTermsText": "Bei Zahlung bis zum 06.06.2026 zahlen Sie mit 2,50 % Skonto € 4.176,90 | Bis zum zum 13.06.2026 ohne Abzug",
    "DueDate": "2026-06-13",
    "DirectDebitMandateId": "",
    "PaymentMeansTypeCode": "58",
    "PaymentMeansInformation": "",
    "PaymentReference": "",
    "Terms": [
      {
        "Description": "Bei Zahlung bis zum 06.06.2026 zahlen Sie mit 2,50 % Skonto € 4.176,90",
        "DueDate": "2026-06-06",
        "DiscountTerms": {
          "BasisDate": "2026-05-30",
          "BasisPeriodDays": 7,
          "BasisAmount": 4284.0,
          "CalculationPercent": 2.5,
          "ActualDiscountAmount": 107.1
        }
      },
      {
        "Description": "Bis zum zum 13.06.2026 ohne Abzug",
        "DueDate": "2026-06-13",
        "DiscountTerms": null
      }
    ]
  },
  "Notes": [
    {
      "Content": "1. Abschlagsrechnung",
      "SubjectCode": "ACB",
      "ContentCode": ""
    },
    {
      "Content": "Geschäftsführer: Herr Geschäftsführer , Muster Bau GmbH etc.",
      "SubjectCode": "REG",
      "ContentCode": ""
    },
    {
      "Content": "Es bestehen Vereinbarungen, aus denen sich Minderungen des Entgelts ergeben können.",
      "SubjectCode": "AAI",
      "ContentCode": ""
    },
    {
      "Content": "ZUGFeRD vers 2.4.0 Extended",
      "SubjectCode": "ACB",
      "ContentCode": ""
    },
    {
      "Content": "Dies ist eine Beispiel-Rechnung zur Darstellung einer  Bau-Abschlags-Rechnung mit Sub-Invoice-Lines und Leistungsverzeichnis-Bezug je Position",
      "SubjectCode": "ACB",
      "ContentCode": ""
    },
    {
      "Content": "Betreff zum LV für eine Kurzinformation zum Bauvorhaben BT-22",
      "SubjectCode": "ACB",
      "ContentCode": ""
    },
    {
      "Content": "Kopftext für zusätzliche Beschreibungen zur Rechnung. Z.B. als Anschreiben für die Rechnung BT-22",
      "SubjectCode": "ACB",
      "ContentCode": ""
    },
    {
      "Content": "ergänzneder Fußtext für die Rechnung mit zusätzlichen Angaben. Z.B: Ist kein gesondertes Lieferdatum angegeben, entspricht das Rechnungsdatum dem Datum der Lieferung und Leistung",
      "SubjectCode": "ACB",
      "ContentCode": ""
    },
    {
      "Content": "freier Text zur Rechnung BT-22",
      "SubjectCode": "ACB",
      "ContentCode": ""
    }
  ],
  "Lines": [
    {
      "Description": "Baugelände abräumen Anfallender Schutt, Pflanzenreste und Müll entsorgen",
      "Quantity": 300.0,
      "UnitCode": "H87",
      "UnitPrice": 7.0,
      "TaxPercent": 19.0,
      "TaxCategory": "S",
      "ProductDescription": "",
      "GlobalId": "",
      "GlobalIdSchemeId": "",
      "SellerAssignedId": "",
      "BuyerOrderReferencedId": "",
      "BuyerOrderDate": null,
      "DeliveryNoteNumber": "",
      "DeliveryNoteLineId": "",
      "DeliveryNoteDate": null,
      "BillingPeriodEndDate": null,
      "AdditionalReferencedDocumentId": "",
      "AdditionalReferencedDocumentTypeCode": "",
      "AdditionalReferencedDocumentReferenceTypeCode": "",
      "OriginCountryCode": "",
      "BuyerOrderLineId": "",
      "LineId": "01.01",
      "ParentLineId": "01",
      "LineStatusReasonCode": "GROUP",
      "BuyerAssignedId": null,
      "ForcedLineTotalAmount": 2100.0
    },
    {
      "Description": "Baugelände abräumen",
      "Quantity": 100.0,
      "UnitCode": "H87",
      "UnitPrice": 7.0,
      "TaxPercent": 19.0,
      "TaxCategory": "S",
      "ProductDescription": "",
      "GlobalId": "",
      "GlobalIdSchemeId": "",
      "SellerAssignedId": "",
      "BuyerOrderReferencedId": "",
      "BuyerOrderDate": null,
      "DeliveryNoteNumber": "",
      "DeliveryNoteLineId": "",
      "DeliveryNoteDate": null,
      "BillingPeriodEndDate": null,
      "AdditionalReferencedDocumentId": "LV 1.1.1.1.1.",
      "AdditionalReferencedDocumentTypeCode": "130",
      "AdditionalReferencedDocumentReferenceTypeCode": "BD",
      "OriginCountryCode": "",
      "BuyerOrderLineId": "",
      "LineId": "01.01.01",
      "ParentLineId": "01.01",
      "LineStatusReasonCode": "DETAIL",
      "BuyerAssignedId": null,
      "ForcedLineTotalAmount": 700.0
    },
    {
      "Description": "Anfallender Pflanzenreste entsorgen",
      "Quantity": 100.0,
      "UnitCode": "H87",
      "UnitPrice": 7.0,
      "TaxPercent": 19.0,
      "TaxCategory": "S",
      "ProductDescription": "",
      "GlobalId": "",
      "GlobalIdSchemeId": "",
      "SellerAssignedId": "",
      "BuyerOrderReferencedId": "",
      "BuyerOrderDate": null,
      "DeliveryNoteNumber": "",
      "DeliveryNoteLineId": "",
      "DeliveryNoteDate": null,
      "BillingPeriodEndDate": null,
      "AdditionalReferencedDocumentId": "LV 1.1.1.1.1.",
      "AdditionalReferencedDocumentTypeCode": "130",
      "AdditionalReferencedDocumentReferenceTypeCode": "BD",
      "OriginCountryCode": "",
      "BuyerOrderLineId": "",
      "LineId": "01.01.02",
      "ParentLineId": "01.01",
      "LineStatusReasonCode": "DETAIL",
      "BuyerAssignedId": null,
      "ForcedLineTotalAmount": 700.0
    },
    {
      "Description": "Müll entsorgen",
      "Quantity": 100.0,
      "UnitCode": "H87",
      "UnitPrice": 7.0,
      "TaxPercent": 19.0,
      "TaxCategory": "S",
      "ProductDescription": "",
      "GlobalId": "",
      "GlobalIdSchemeId": "",
      "SellerAssignedId": "",
      "BuyerOrderReferencedId": "",
      "BuyerOrderDate": null,
      "DeliveryNoteNumber": "",
      "DeliveryNoteLineId": "",
      "DeliveryNoteDate": null,
      "BillingPeriodEndDate": null,
      "AdditionalReferencedDocumentId": "LV 1.1.1.1.1.",
      "AdditionalReferencedDocumentTypeCode": "130",
      "AdditionalReferencedDocumentReferenceTypeCode": "BD",
      "OriginCountryCode": "",
      "BuyerOrderLineId": "",
      "LineId": "01.01.03",
      "ParentLineId": "01.01",
      "LineStatusReasonCode": "DETAIL",
      "BuyerAssignedId": null,
      "ForcedLineTotalAmount": 700.0
    },
    {
      "Description": "Pflasterfläche vorbereiten, Planum herstellen und verdichten",
      "Quantity": 250.0,
      "UnitCode": "MTK",
      "UnitPrice": 6.0,
      "TaxPercent": 19.0,
      "TaxCategory": "S",
      "ProductDescription": "",
      "GlobalId": "",
      "GlobalIdSchemeId": "",
      "SellerAssignedId": "",
      "BuyerOrderReferencedId": "",
      "BuyerOrderDate": null,
      "DeliveryNoteNumber": "",
      "DeliveryNoteLineId": "",
      "DeliveryNoteDate": null,
      "BillingPeriodEndDate": null,
      "AdditionalReferencedDocumentId": "",
      "AdditionalReferencedDocumentTypeCode": "",
      "AdditionalReferencedDocumentReferenceTypeCode": "",
      "OriginCountryCode": "",
      "BuyerOrderLineId": "",
      "LineId": "01.02",
      "ParentLineId": "01",
      "LineStatusReasonCode": "DETAIL",
      "BuyerAssignedId": null,
      "ForcedLineTotalAmount": 1500.0
    },
    {
      "Description": "Summe 01 Bauabschnitt 1 - Vorarbeiten",
      "Quantity": 1.0,
      "UnitCode": "H87",
      "UnitPrice": 3600.0,
      "TaxPercent": 19.0,
      "TaxCategory": "S",
      "ProductDescription": "",
      "GlobalId": "",
      "GlobalIdSchemeId": "",
      "SellerAssignedId": "",
      "BuyerOrderReferencedId": "",
      "BuyerOrderDate": null,
      "DeliveryNoteNumber": "",
      "DeliveryNoteLineId": "",
      "DeliveryNoteDate": null,
      "BillingPeriodEndDate": null,
      "AdditionalReferencedDocumentId": "",
      "AdditionalReferencedDocumentTypeCode": "",
      "AdditionalReferencedDocumentReferenceTypeCode": "",
      "OriginCountryCode": "",
      "BuyerOrderLineId": "000001",
      "LineId": "01",
      "ParentLineId": null,
      "LineStatusReasonCode": "GROUP",
      "BuyerAssignedId": null,
      "ForcedLineTotalAmount": 3600.0
    }
  ],
  "BuyerReference": "Kundenref. BT-10",
  "SellerOrderReferencedId": "G12042-1-01",
  "BuyerOrderReferencedId": "BT-13",
  "ContractReferencedId": "Vertragsnr. BT-12",
  "AdditionalReferencedDocumentId": "Vergabenr. BT-17",
  "AdditionalReferencedDocumentTypeCode": "50",
  "ProcuringProjectId": "Projektnr. BT-11",
  "ProcuringProjectName": "Project reference",
  "ReceivableAccountingAccountId": "Kostenstelle BT-19",
  "HeaderChargeTotalAmount": 0.0,
  "HeaderAllowanceTotalAmount": 0.0,
  "HeaderTotalPrepaidAmount": 0.0,
  "HeaderDuePayableAmount": 4284.0
}