Tests/tulo.eInvocieXmlGeneratorCiiTests/JsonExamples/ZF_Extended__Abschlagsrechnung_SubInvoiceLine_u_LV_Nr_.json

{
  "InvoiceNumber": "210111 mit LV",
  "InvoiceDate": "2026-05-30",
  "Currency": "EUR",
  "DocumentName": null,
  "DocumentTypeCode": "875",
  "Seller": {
    "ID": "998877",
    "Name": "Musterbetrieb AG Demodaten",
    "Street": "August-Spindler-Strasse 222",
    "Zip": "37079",
    "City": "Göttingen",
    "CountryCode": "DE",
    "VatId": "",
    "LeitwegId": "",
    "FiscalId": null,
    "GeneralEmail": null,
    "ContactPersonName": "Kontaktperson",
    "ContactPhone": "5578",
    "ContactEmail": "absender@musterberieb.de",
    "LegalOrganizationId": "HRA 45678"
  },
  "Buyer": {
    "ID": "330145",
    "Name": "Auftraggeber Firmenkunde GmbH",
    "Street": "Gartenstraße 1212",
    "Zip": "37073",
    "City": "Göttingen",
    "CountryCode": "DE",
    "VatId": "",
    "LeitwegId": "",
    "FiscalId": null,
    "GeneralEmail": null,
    "ContactPersonName": "Herr Thomas Auftraggeber",
    "ContactPhone": "+49 321 456789",
    "ContactEmail": "thomas.auftraggeber@Firmenkunde.de",
    "LegalOrganizationId": null
  },
  "Payment": {
    "Iban": "DE75512108001245126199",
    "Bic": "PBNKDEFF",
    "AccountName": "Musterbetrieb Kontoname",
    "PaymentTermsText": "Bei Zahlung bis zum 06.06.2026 zahlen Sie mit 2,50 % Skonto € 4.176,90",
    "DueDate": "2026-06-13",
    "DirectDebitMandateId": null,
    "PaymentMeansTypeCode": "58",
    "PaymentMeansInformation": null,
    "PaymentReference": null,
    "Terms": [
      {
        "Description": "Bei Zahlung bis zum 06.06.2026 zahlen Sie mit 2,50 % Skonto € 4.176,90",
        "DueDate": "2026-06-06",
        "DiscountTerms": {
          "BasisDate": "2026-05-30",
          "BasisPeriodDays": 7,
          "BasisAmount": 4284.0,
          "CalculationPercent": 2.5,
          "ActualDiscountAmount": 107.1
        }
      },
      {
        "Description": "Bis zum zum 13.06.2026 ohne Abzug",
        "DueDate": "2026-06-13",
        "DiscountTerms": null
      }
    ]
  },
  "Notes": [
    {
      "ContentCode": "",
      "Content": "1. Abschlagsrechnung",
      "SubjectCode": "ACB"
    },
    {
      "ContentCode": "",
      "Content": "Geschäftsführer: Herr Geschäftsführer , Muster Bau GmbH etc.",
      "SubjectCode": "REG"
    },
    {
      "ContentCode": "",
      "Content": "Es bestehen Vereinbarungen, aus denen sich Minderungen des Entgelts ergeben können.",
      "SubjectCode": "AAI"
    },
    {
      "ContentCode": "",
      "Content": "ZUGFeRD vers 2.4.0 Extended",
      "SubjectCode": "ACB"
    },
    {
      "ContentCode": "",
      "Content": "Dies ist eine Beispiel-Rechnung zur Darstellung einer  Bau-Abschlags-Rechnung mit Sub-Invoice-Lines und Leistungsverzeichnis-Bezug je Position",
      "SubjectCode": "ACB"
    },
    {
      "ContentCode": "",
      "Content": "Betreff zum LV für eine Kurzinformation zum Bauvorhaben BT-22",
      "SubjectCode": "ACB"
    },
    {
      "ContentCode": "",
      "Content": "Kopftext für zusätzliche Beschreibungen zur Rechnung. Z.B. als Anschreiben für die Rechnung BT-22",
      "SubjectCode": "ACB"
    },
    {
      "ContentCode": "",
      "Content": "ergänzneder Fußtext für die Rechnung mit zusätzlichen Angaben. Z.B: Ist kein gesondertes Lieferdatum angegeben, entspricht das Rechnungsdatum dem Datum der Lieferung und Leistung",
      "SubjectCode": "ACB"
    },
    {
      "ContentCode": "",
      "Content": "freier Text zur Rechnung BT-22",
      "SubjectCode": "ACB"
    }
  ],
  "Lines": [
    {
      "DeliveryNoteLineId": "",
      "TaxCategory": "S",
      "UnitCode": "H87",
      "UnitPrice": 7.0,
      "LineStatusReasonCode": "GROUP",
      "TaxPercent": 19.0,
      "GlobalIdSchemeId": "",
      "DeliveryNoteDate": null,
      "AdditionalReferencedDocumentId": "",
      "AdditionalReferencedDocumentReferenceTypeCode": "",
      "BuyerAssignedId": null,
      "SellerAssignedId": "",
      "GlobalId": "",
      "ParentLineId": "01",
      "BuyerOrderLineId": "",
      "Quantity": 300.0,
      "BuyerOrderReferencedId": "",
      "ForcedLineTotalAmount": 2100.0,
      "LineId": "01.01",
      "Description": "Baugelände abräumen Anfallender Schutt, Pflanzenreste und Müll entsorgen",
      "PriceBasisQuantity": null,
      "BillingPeriodEndDate": null,
      "BuyerOrderDate": null,
      "OriginCountryCode": "",
      "AdditionalReferencedDocumentTypeCode": "",
      "DeliveryNoteNumber": "",
      "ProductDescription": ""
    },
    {
      "DeliveryNoteLineId": "",
      "TaxCategory": "S",
      "UnitCode": "H87",
      "UnitPrice": 7.0,
      "LineStatusReasonCode": "DETAIL",
      "TaxPercent": 19.0,
      "GlobalIdSchemeId": "",
      "DeliveryNoteDate": null,
      "AdditionalReferencedDocumentId": "LV 1.1.1.1.1.",
      "AdditionalReferencedDocumentReferenceTypeCode": "BD",
      "BuyerAssignedId": null,
      "SellerAssignedId": "",
      "GlobalId": "",
      "ParentLineId": "01.01",
      "BuyerOrderLineId": "LV000001.1",
      "Quantity": 100.0,
      "BuyerOrderReferencedId": "",
      "ForcedLineTotalAmount": 700.0,
      "LineId": "01.01.01",
      "Description": "Baugelände abräumen",
      "PriceBasisQuantity": null,
      "BillingPeriodEndDate": null,
      "BuyerOrderDate": null,
      "OriginCountryCode": "",
      "AdditionalReferencedDocumentTypeCode": "130",
      "DeliveryNoteNumber": "",
      "ProductDescription": ""
    },
    {
      "DeliveryNoteLineId": "",
      "TaxCategory": "S",
      "UnitCode": "H87",
      "UnitPrice": 7.0,
      "LineStatusReasonCode": "DETAIL",
      "TaxPercent": 19.0,
      "GlobalIdSchemeId": "",
      "DeliveryNoteDate": null,
      "AdditionalReferencedDocumentId": "LV 1.1.1.1.1.",
      "AdditionalReferencedDocumentReferenceTypeCode": "BD",
      "BuyerAssignedId": null,
      "SellerAssignedId": "",
      "GlobalId": "",
      "ParentLineId": "01.01",
      "BuyerOrderLineId": "LV000001.2",
      "Quantity": 100.0,
      "BuyerOrderReferencedId": "",
      "ForcedLineTotalAmount": 700.0,
      "LineId": "01.01.02",
      "Description": "Anfallender Pflanzenreste entsorgen",
      "PriceBasisQuantity": null,
      "BillingPeriodEndDate": null,
      "BuyerOrderDate": null,
      "OriginCountryCode": "",
      "AdditionalReferencedDocumentTypeCode": "130",
      "DeliveryNoteNumber": "",
      "ProductDescription": ""
    },
    {
      "DeliveryNoteLineId": "",
      "TaxCategory": "S",
      "UnitCode": "H87",
      "UnitPrice": 7.0,
      "LineStatusReasonCode": "DETAIL",
      "TaxPercent": 19.0,
      "GlobalIdSchemeId": "",
      "DeliveryNoteDate": null,
      "AdditionalReferencedDocumentId": "LV 1.1.1.1.1.",
      "AdditionalReferencedDocumentReferenceTypeCode": "BD",
      "BuyerAssignedId": null,
      "SellerAssignedId": "",
      "GlobalId": "",
      "ParentLineId": "01.01",
      "BuyerOrderLineId": "LV000001.3",
      "Quantity": 100.0,
      "BuyerOrderReferencedId": "",
      "ForcedLineTotalAmount": 700.0,
      "LineId": "01.01.03",
      "Description": "Müll entsorgen",
      "PriceBasisQuantity": null,
      "BillingPeriodEndDate": null,
      "BuyerOrderDate": null,
      "OriginCountryCode": "",
      "AdditionalReferencedDocumentTypeCode": "130",
      "DeliveryNoteNumber": "",
      "ProductDescription": ""
    },
    {
      "DeliveryNoteLineId": "",
      "TaxCategory": "S",
      "UnitCode": "MTK",
      "UnitPrice": 6.0,
      "LineStatusReasonCode": "DETAIL",
      "TaxPercent": 19.0,
      "GlobalIdSchemeId": "",
      "DeliveryNoteDate": null,
      "AdditionalReferencedDocumentId": "",
      "AdditionalReferencedDocumentReferenceTypeCode": "",
      "BuyerAssignedId": null,
      "SellerAssignedId": "",
      "GlobalId": "",
      "ParentLineId": "01",
      "BuyerOrderLineId": "",
      "Quantity": 250.0,
      "BuyerOrderReferencedId": "",
      "ForcedLineTotalAmount": 1500.0,
      "LineId": "01.02",
      "Description": "Pflasterfläche vorbereiten, Planum herstellen und verdichten",
      "PriceBasisQuantity": null,
      "BillingPeriodEndDate": null,
      "BuyerOrderDate": null,
      "OriginCountryCode": "",
      "AdditionalReferencedDocumentTypeCode": "",
      "DeliveryNoteNumber": "",
      "ProductDescription": ""
    },
    {
      "DeliveryNoteLineId": "",
      "TaxCategory": "S",
      "UnitCode": "H87",
      "UnitPrice": 3600.0,
      "LineStatusReasonCode": "GROUP",
      "TaxPercent": 19.0,
      "GlobalIdSchemeId": "",
      "DeliveryNoteDate": null,
      "AdditionalReferencedDocumentId": "",
      "AdditionalReferencedDocumentReferenceTypeCode": "",
      "BuyerAssignedId": null,
      "SellerAssignedId": "",
      "GlobalId": "",
      "ParentLineId": null,
      "BuyerOrderLineId": "",
      "Quantity": 1.0,
      "BuyerOrderReferencedId": "",
      "ForcedLineTotalAmount": 3600.0,
      "LineId": "01",
      "Description": "Summe 01 Bauabschnitt 1 - Vorarbeiten",
      "PriceBasisQuantity": 1.0,
      "BillingPeriodEndDate": null,
      "BuyerOrderDate": null,
      "OriginCountryCode": "",
      "AdditionalReferencedDocumentTypeCode": "",
      "DeliveryNoteNumber": "",
      "ProductDescription": ""
    }
  ],
  "BuyerReference": "Kundenref. BT-10",
  "SellerOrderReferencedId": "G12042-1-01",
  "BuyerOrderReferencedId": "BT-13",
  "ContractReferencedId": "Vertragsnr. BT-12",
  "AdditionalReferencedDocumentId": "Vergabenr. BT-17",
  "AdditionalReferencedDocumentTypeCode": "50",
  "ProcuringProjectId": "Projektnr. BT-11",
  "ProcuringProjectName": "Project reference",
  "ReceivableAccountingAccountId": "Kostenstelle BT-19",
  "HeaderChargeTotalAmount": 0.0,
  "HeaderAllowanceTotalAmount": 0.0,
  "HeaderTotalPrepaidAmount": 0.0,
  "HeaderDuePayableAmount": 4284.0
}